app/Controllers/CompraEstadoController.php

SELECT *
FROM `compra`
---
     public function listarProductos(){
        $compraModel= new CompraModel();
        $compras=$compraModel->findAll();

SELECT `compraestado`.*, `compraestadotipo`.`cetdescripcion` as `estado`
FROM `compraestado`
JOIN `compraestadotipo` ON `compraestado`.`idcompraestadotipo` = `compraestadotipo`.`idcompraestadotipo`
WHERE `idcompra` = '1'
ORDER BY `compraestado`.`idcompraestado` DESC
 LIMIT 1
---
    public function listar()
    {
        $estadoCompras = $this->estadoCompraModel->join('compraestadotipo', 'compraestado.idcompraestadotipo = compraestadotipo.idcompraestadotipo')
                                                 ->select('compraestado.*, compraestadotipo.cetdescripcion as estado')
                                                 ->findAll();