app/Controllers/Session.php

SELECT *
FROM `usuario`
WHERE `usnombre` = 'alexa'
AND `uspass` = 'ef797c8118f02dfb649607dd5d3f8c7623048c9c063d532cc95c5ed7a898a64f'
AND `usuario`.`usdeshabilitado` IS NULL
 LIMIT 1
---
    public function autenticar(){
        $data = $this->request->getPost(['usnombre','uspass']);

        $usuarioModelo = new UsuarioModel();
        $usuario = $usuarioModelo->where(['usnombre'=>$data['usnombre'],'uspass'=>$data['uspass']])->first();