app/Controllers/UsuarioController.php

    public function listar(){
        $usuarios = $this->usuarioModel->findAll();
        $aux = [];
        foreach($usuarios as $usuario){
            $idUsuario = $usuario['idusuario'];
            $usuarioRolModel = new UsuarioRolModel();
            $usuarioRol = $usuarioRolModel->where('idusuario', $idUsuario)->findAll();
            $roles = '';
            foreach($usuarioRol as $rol){
                $rolModel = new RolModel();
                $rol = $rolModel->find($rol['idrol']);
---
SELECT *
FROM `usuariorol`
WHERE `idusuario` = '18'
SELECT *
FROM `rol`
WHERE `rol`.`idrol` = '1'