app/Controllers/UsuarioController.php

    public function verificar(){
        $data=$this->request->getPost();
        $idUsuario=session('idusuario');
        $retorno['success']=false;
        if(isset($data['uspass']) && $data['uspass']!=""){
            $usuarioModelo = new UsuarioModel();
            $usuario = $usuarioModelo->where('idusuario',$idUsuario)->where('uspass',$data['uspass'])->first();
---
SELECT *
FROM `usuario`
WHERE `idusuario` = '18'
AND `uspass` = '15e2b0d3c33891ebb0f1ef609ec419420c20e320ce94c65fbc8c3312448eb225'
AND `usuario`.`usdeshabilitado` IS NULL
 LIMIT 1