app/Models/CompraEstadoModel.php

SELECT *
FROM `compra`
WHERE `compra`.`idcompra` = '1'
SELECT *
FROM `compraestado`
WHERE `idcompra` = '1'
ORDER BY `idcompraestado` DESC
 LIMIT 1
UPDATE `compraestado` SET `cefechafin` = '2024-11-21 20:38:08'
WHERE `compraestado`.`idcompraestado` IN ('3')
INSERT INTO `compraestado` (`idcompra`, `idcompraestadotipo`, `cefechaini`) VALUES ('1', 4, '2024-11-21 20:38:08')
---
    public function actualizar($idCompra){
        $compraModel= new CompraModel();
        $compra=$compraModel->find($idCompra);
        $actualizado = false;
        if($compra){
            $ultimoEstadoCompra=$this->where('idcompra', $idCompra)
                 ->orderBy('idcompraestado', 'DESC')
                 ->first();
            $idUltimoEstadoCompra = $ultimoEstadoCompra['idcompraestado'];
            $finalizar=['cefechafin'=>date('Y-m-d H:i:s')];
            $this->update($idUltimoEstadoCompra, $finalizar);
            $ultimoEstado = $ultimoEstadoCompra['idcompraestadotipo'];
            $data['idcompra']=$idCompra;
            $data['idcompraestadotipo']=$ultimoEstado+1;
            $data['cefechaini']=date('Y-m-d H:i:s');
            if($idUltimoEstadoCompra==5){
                $data['cefechafin']=date('Y-m-d H:i:s');
            }
            if($this->insert($data)){