app/Models/MenuModel.php

SELECT *
FROM `menurol`
WHERE `idmenu` = '1'
SELECT *
FROM `rol`
WHERE `rol`.`idrol` = '1'
---
    public function darNombreRoles($idmenu){
        $roles = [];
        $menuRolModel = new MenuRolModel();
        $rolesMenu = $menuRolModel->where('idmenu', $idmenu)->findAll();
        if(count($rolesMenu) != 0){
            $rolModel = new RolModel();
            foreach($rolesMenu as $rolMenu){
                $rol = $rolModel->find($rolMenu['idrol']);

SELECT *
FROM `menurol`
WHERE `idrol` = '1'
---
    public function darMenusRol($idrol){
        $menus = [];
        $menuRolModel = new MenuRolModel();
        $rolesMenu = $menuRolModel->where('idrol', $idrol)->findAll();

SELECT *
FROM `menu`
---
    public function listar(){
        $menus = $this->withDeleted()->findAll();