app/Models/UsuarioModel.php

SELECT *
FROM `usuariorol`
WHERE `idusuario` = '18'
SELECT *
FROM `rol`
WHERE `rol`.`idrol` = '1'
---
    public function darRoles($idUsuario){
        $usuario = $this->find($idUsuario);
        $roles = [];
        if($usuario){
            $usuarioRolModel = new UsuarioRolModel();
            $rolesUsuario = $usuarioRolModel->where('idusuario', $idUsuario)->findAll();
            if(count($rolesUsuario) != 0){
                $rolModel = new RolModel();
                foreach($rolesUsuario as $rolUsuario){
                    $rol = $rolModel->find($rolUsuario['idrol']);

SELECT *
FROM `usuariorol`
WHERE `idusuario` = '18'
SELECT *
FROM `rol`
WHERE `rol`.`idrol` = '1'
---
    public function darNombreRoles($idUsuario){
        $usuario = $this->find($idUsuario);
        $roles = [];
        if($usuario){
            $usuarioRolModel = new UsuarioRolModel();
            $rolesUsuario = $usuarioRolModel->where('idusuario', $idUsuario)->findAll();
            if(count($rolesUsuario) != 0){
                $rolModel = new RolModel();
                foreach($rolesUsuario as $rolUsuario){
                    $rol = $rolModel->find($rolUsuario['idrol']);

SELECT *
FROM `usuario`
---
    public function listar(){
        $usuarios = $this->withDeleted()->findAll();